_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 9)                 90        
_________________________________________________________________
dense_2 (Dense)              (None, 27)                270       
_________________________________________________________________
dropout_1 (Dropout)          (None, 27)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 54)                1512      
_________________________________________________________________
dropout_2 (Dropout)          (None, 54)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 27)                1485      
_________________________________________________________________
dropout_3 (Dropout)          (None, 27)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 28        
=================================================================
Total params: 3,385
Trainable params: 3,385
Non-trainable params: 0
_________________________________________________________________
