_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 62, 62, 512)       5120      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 31, 31, 512)       0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 31, 31, 512)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 29, 29, 256)       1179904   
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 14, 14, 256)       0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 14, 14, 256)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 12, 12, 512)       1180160   
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 12, 12, 512)       0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 12, 12, 512)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 10, 10, 256)       1179904   
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 10, 10, 256)       0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 10, 10, 256)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 25600)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              26215424  
_________________________________________________________________
dense_2 (Dense)              (None, 256)               262400    
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 257       
=================================================================
Total params: 30,023,169
Trainable params: 30,023,169
Non-trainable params: 0
_________________________________________________________________
