_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_6 (Dense)              (None, 16)                496       
_________________________________________________________________
dense_7 (Dense)              (None, 8)                 136       
_________________________________________________________________
dense_8 (Dense)              (None, 6)                 54        
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 7         
=================================================================
Total params: 693
Trainable params: 693
Non-trainable params: 0
_________________________________________________________________
